stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc.c
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_rcc.c
  * @author  MCD Application Team
  * @brief   RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Reset and Clock Control (RCC) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                      ##### RCC specific features #####
  ==============================================================================
    [..]
      After reset the device is running from Multi-Speed Internal RC oscillator
      at 12 MHz with Flash 1 wait state. Flash prefetch buffer and I-Cache are
      disabled and all peripherals are off except internal SRAMs, Flash and SWD.
      (+) There is no prescaler on High speed (AHBs) and no prescaler Low speed
          (APBs) busses: all peripherals mapped on these busses are running at
          SYSCLK speed.
      (+) The clock for all peripherals is switched off, except SRAMs and FLASH.
      (+) All GPIOs are in analog mode, except the JTAG pins which
          are assigned to be used for debug purpose.

    [..]
      Once the device started, the user application has to:
      (+) Configure the clock source to be used to drive the System clock
          (if the application needs higher frequency/performance)
      (+) Configure the System clock frequency and Flash settings
      (+) Configure the AHB and APB busses prescalers
      (+) Enable the clock for the peripheral(s) to be used
      (+) Configure the kernel clock source(s) for peripherals which clocks are
          not derived from the System clock.

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

/** @defgroup RCC RCC
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */
/* timeout value */
/* LSI maximum timeout is 16 us plus 4 LSI clock cycles when prediv is used */
#define HSE_TIMEOUT_VALUE               HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE               (2U)    /* 2 ms (minimum Tick + 1) */
#define HSI48_TIMEOUT_VALUE             (2U)    /* 2 ms (minimum Tick + 1) */
#define LSI_TIMEOUT_VALUE               ((5u * 128u * 1000u) / LSI_VALUE)
#define MSI_TIMEOUT_VALUE               (2U)    /* 2 ms (minimum Tick + 1) */
#define CLOCKSWITCH_TIMEOUT_VALUE       5000U     /* 5 s    */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @defgroup RCC_Private_Macros RCC Private Macros
  * @{
  */
#define __MCO_CLK_ENABLE()              __HAL_RCC_GPIOA_CLK_ENABLE()
#define MCO_GPIO_PORT                   GPIOA
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_Exported_Functions_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
  @verbatim
 ===============================================================================
           ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      This section provides functions allowing to configure the internal and external oscillators
      (HSE, HSI, LSE, LSI, MSIS and MSIK, CSS and MCO) and the System busses clocks (SYSCLK,
      AHB1, AHB2, APB1, APB2, APB3).

    [..] Internal/external clock configuration

         (+) HSE (high-speed external): 4 to 50 MHz crystal oscillator that can be used directly
             as System clock source. It can be used also optionally as kernel clock source for peripherals,
             especially as RTC clock source.

         (+) LSE (low-speed external): 32.768 KHz oscillator can be used as peripheral kernel clock
             source, especially as RTC clock source.

         (+) HSI (high-speed internal): 16 MHz factory-trimmed RC that can used directly as System
             clock source and as peripheral kernel clock source.

         (+) LSI (low-speed internal): 32 KHz low consumption RC used as peripheral kernel clock source
             including IWDG and RTC.

         (+) MSIS (multi-speed internal system): 3 to 96 MHz factory-trimmed RC that can used directly as System
             clock source.

         (+) MSIK (multi-speed internal kernem): 3 to 96 MHz factory-trimmed RC that can used as
             peripheral kernel clock source.

         (+) CSS (Clock security system): once enabled, if a HSE clock failure occurs
             and HSE is used directly as System clock source, the System clock
             is automatically switched to HSI and an interrupt is generated if enabled.
             The interrupt is linked to the Cortex-M33 NMI (Non-Maskable Interrupt)
             exception vector.

         (+) MCO (microcontroller clock output): used to output LSI, HSI, LSE, HSE, SYSCLK, clocks
            (through a configurable prescaler) on PA8 pin.

