stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_rcc.c
    [..] System, AHB and APB busses clocks configuration
         (+) Several clock sources can be used to drive the System clock (SYSCLK): HSE, HSI, MSIS
             The AHB clock (HCLK) is derived from System clock through configurable
             prescaler and used to clock the CPU, memory and peripherals mapped
             on AHB bus (DMA, GPIO...). APB1 (PCLK1), APB2 (PCLK2) clocks are derived
             from AHB clock through configurable prescalers and used to clock
             the peripherals mapped on these busses. You can use
             @ref HAL_RCC_GetSysClockFreq(), HAL_RCC_GetHCLKFreq, HAL_RCC_GetPCLK1Freq, HAL_RCC_GetPCLK2Freq
             HAL_RCC_GetPCLK3Freq functions to retrieve these clock frequencies.

         -@- All the peripheral kernel clocks are derived from the System clock (SYSCLK) but some
             peripheral can select a different source (you have to use HAL_RCCEx_PeriphCLKConfig()
             function to configure it) :
           (+@) U(S)ARTx (x = 1, 3 , 4, 5) :Kernel clock can be PCLKx or HSI.
           (+@) I3Cx (x = 1, 2) : Kernel clock can be PCLKx or MSIK.
           (+@) I2Cx (x = 1, 2, 3) : Kernel clock can be PCLKx or MSIK.
           (+@) SPIx (x = 1, 2, 3) : Kernel clock can be PCLKx or MSIK.
           (+@) LPTIMx (x = 1, 3, 4) : Kernel clock can be MSIK, LSI, HSI or LSE.
           (+@) LPTIM2 : Kernel clock can be PCLK1, LSI, HSI or LSE.
           (+@) SYSTICK : Kernel clock can be HCLK/8, LSI or LSE when external clock is selected in SysTick.
           (+@) FDCAN : Kernel clock can be SYSCLK or MSIK.
           (+@) ICLK : Kernel clock can be HSI48, MSIK, HSE or SYSCLK.
           (+@) USB1 : Kernel clock can be ICLK or ICLK/2.
           (+@) TIMIC : Kernel clock can be HSI/256, MSIS/1024, MSIS/4, MSIK/1024 or MSIK/4.
           (+@) ADF1 : Kernel clock can be HCLK, AUDIOCLK input pin, MSIK or SAI1.
           (+@) SAI1 : Kernel clock can be MSIK, AUDIOCLK input pin or HSE.
           (+@) RNG : Kernel clock can be HSI48 or MSIK.
           (+@) ADC12 / DAC : Kernel clock can be HCLK, HSE or MSIK. Selected clock can be then divided by 2^x
                              (x = 0 to 9).
           (+@) DAC1SH : Kernel clock can be LSE or LSI.
           (+@) OCTOSPI1 : Kernel clock can be SYSCLK or MSIK.
           (+@) LPUART1 : Kernel clock can be PCLK3, HSI, LSE or MSIK.
           (+@) RTC : Kernel clock can be LSI, LSE or HSE clock divided by 32.

         (+) The maximum frequency of SYSCLK / AHB1 / AHB2 / APB1 / APB2 / APB3 is
              (++) 96 MHz at voltage range 1
              (++) 48 MHZ at voltage range 2
             The clock source frequency should be adapted depending on the device voltage range
             as listed in the Reference Manual "Clock source frequency versus voltage scaling" chapter.

  @endverbatim

           Table 1. Flash latency versus HCLK clock frequency and voltage scaling ranges.
                    when flash low power mode is disabled (LPM = 0)
           +-------------------------------------------------------+
           | Latency         |     HCLK clock frequency (MHz)      |
           |                 |-------------------------------------|
           |                 | voltage range 1  | voltage range 2  |
           |                 |      0.9 V       |      0.75 V      |
           |-----------------|------------------|------------------|
           |0WS(1 CPU cycles)|      HCLK <= 32  |      HCLK <= 16  |
           |-----------------|------------------|------------------|
           |1WS(2 CPU cycles)|      HCLK <= 64  |      HCLK <= 32  |
           |-----------------|------------------|------------------|
           |2WS(3 CPU cycles)|      HCLK <= 96  |      HCLK <= 48  |
           +-----------------+------------------+------------------+

           Table 2. EPOD booster mode versus HCLK clock frequency and voltage scaling ranges.
           +-------------------------------------------------------+
           | EPOD booster    |     HCLK clock frequency (MHz)      |
           |                 |-------------------------------------|
           |                 | voltage range 1  | voltage range 2  |
           |                 |      0.9 V       |      0.75 V      |
           |-----------------|------------------|------------------|
           | Disabled        |      HCLK <= 24  |      HCLK <= 24  |
           |-----------------|------------------|------------------|
           | Enabled         |      HCLK <= 96  |      HCLK <= 48  |
           +-----------------+------------------+------------------+
  * @{
  */

/**
  * @brief  Reset the RCC clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - MSIS & MSIK ON and used as system clock source
  *            - HSE OFF
  *            - AHB1, AHB2, APB1, APB2 and APB3 prescaler set to 1.
  *            - CSS, MCO1 and MCO2 OFF
  *            - All interrupts disabled and cleared
  * @note   This function doesn't modify the configuration of the
  *            - Peripheral clocks
  *            - LSI, LSE and RTC clocks
  * @retval None
  */
HAL_StatusTypeDef HAL_RCC_DeInit(void)
{
  uint32_t tickstart;

  /* Get start tick*/
  tickstart = HAL_GetTick();

  /* Set MSISON and MSIKON bit */
  SET_BIT(RCC->CR, (RCC_CR_MSISON | RCC_CR_MSIKON));

  /* Wait till MSIS is ready */
  while (READ_BIT(RCC->CR, RCC_CR_MSISRDY) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > HSI_TIMEOUT_VALUE)
    {
      if (READ_BIT(RCC->CR, RCC_CR_MSISRDY) == 0U)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* Select MSIS and MSIK source and divider */
  MODIFY_REG(RCC->ICSCR1, (RCC_ICSCR1_MSISDIV | RCC_ICSCR1_MSIKDIV),
             (RCC_ICSCR1_MSISDIV_0 | RCC_ICSCR1_MSISSEL | RCC_ICSCR1_MSIKDIV_0 | RCC_ICSCR1_MSIKSEL));

  /* Set MSRCx trimming default value */
  WRITE_REG(RCC->ICSCR2, (RCC_ICSCR2_MSITRIM1_5 | RCC_ICSCR2_MSITRIM0_5));

  /* Set HSITRIM default value */
  WRITE_REG(RCC->ICSCR3, RCC_ICSCR3_HSITRIM_4);

